lvx/base/Documents/бит_вго_ПодтверждениеСверкиВГО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_вго_ПодтверждениеСверкиВГО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_вго_СтатусыСверкиВГО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодаСверкиВГО</Name>
					<Comment>Период сверки ВГО</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАбсолютногоРасхождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАбсолютногоРасхожденияВзм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеВзм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьРасхождение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьДопустимоеРасхождение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьДопустимоеРасхождениеВзм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Documents/бит_вго_ПодтверждениеСверкиВГО/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура выполняет первоначальное заполнение созданного/скопированного документа.
// 
// Параметры:
//  ПараметрОбъектКопирования - ДокументОбъект.
// 
Процедура ПервоначальноеЗаполнениеДокумента(ПараметрОбъектКопирования = Неопределено)
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект,
		Пользователи.ТекущийПользователь(), ПараметрОбъектКопирования);
	
КонецПроцедуры
											
// Процедура получает сумму абсолютного расхождения.
// 
// Параметры:
//  Нет
// 
Процедура ПолучитьДанныеДляПроверкиЗавершенияСверки(Отказ = Ложь, ЭтоПроведение, ВыводитьСообщениеОбИзмененииСумм = Истина, МодифицированностьФормы = Ложь) Экспорт

	СуммаТемп_АРУ = СуммаАбсолютногоРасхождения;
	СуммаТемп_АРВ = СуммаАбсолютногоРасхожденияВзм;
	СуммаТемп_ДРУ = ДопустимоеРасхождение;
	СуммаТемп_ДРВ = ДопустимоеРасхождениеВзм;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаНачала"		 	 , ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончания" 		 , ДатаОкончания);
	СтруктураПараметров.Вставить("РегистрБухгалтерии"    , РегистрБухгалтерии);
	СтруктураПараметров.Вставить("Организация1" 		 , Организация1);
	СтруктураПараметров.Вставить("Организация2"		 	 , Организация2);
	СтруктураПараметров.Вставить("Контрагент1"  		 , Контрагент1);
	СтруктураПараметров.Вставить("Контрагент2" 		 	 , Контрагент2);
	СтруктураПараметров.Вставить("Сценарий" 	 		 , Сценарий);
	СтруктураПараметров.Вставить("ИмяРегистраБухгалтерии", РегистрБухгалтерии.ИмяОбъекта);

	ДанныеДляПроверки = Отчеты.бит_вго_СтатусСверкиВГО.ПолучитьДанныеДляПроверкиЗавершенияСверки(СтруктураПараметров);		
	СуммаАбсолютногоРасхождения 	= ДанныеДляПроверки.СуммаАбсолютногоРасхождения;	
	СуммаАбсолютногоРасхожденияВзм  = ДанныеДляПроверки.СуммаАбсолютногоРасхожденияВзм;
	ДопустимоеРасхождение    = ДанныеДляПроверки.ДопустимоеРасхождение;
	ДопустимоеРасхождениеВзм = ДанныеДляПроверки.ДопустимоеРасхождениеВзм;
	КонтролироватьДопустимоеРасхождение    = ДанныеДляПроверки.КонтролироватьДопустимоеРасхождение;
	КонтролироватьДопустимоеРасхождениеВзм = ДанныеДляПроверки.КонтролироватьДопустимоеРасхождениеВзм;

	Если СуммаТемп_АРУ <> СуммаАбсолютногоРасхождения
		ИЛИ СуммаТемп_АРВ <> СуммаАбсолютногоРасхожденияВзм
		ИЛИ СуммаТемп_ДРУ <> ДопустимоеРасхождение
		ИЛИ СуммаТемп_ДРВ <> ДопустимоеРасхождениеВзм Тогда
		МодифицированностьФормы = Истина;	
	КонецЕсли;
	
	Если ВыводитьСообщениеОбИзмененииСумм Тогда 	
		Если СуммаТемп_АРУ <> СуммаАбсолютногоРасхождения Тогда             	
			ТекстСообщения = НСтр("ru='Сумма абсолютного расхождения (по управленческому учету) = %1.';
								  |en='Total absolute imbalance (management accounting) = %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СуммаАбсолютногоРасхождения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);  	
		КонецЕсли;
		Если СуммаТемп_АРВ <> СуммаАбсолютногоРасхожденияВзм Тогда             	
			ТекстСообщения = НСтр("ru='Сумма абсолютного расхождения (по взаиморасчетам) = %1.';
								  |en='Total absolute imbalance (settlements) = %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СуммаАбсолютногоРасхожденияВзм);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);  	
		КонецЕсли;
	КонецЕсли;
	
	ПревышениеДопустимогоРасхождения = Ложь;
	Если КонтролироватьДопустимоеРасхождение И СуммаАбсолютногоРасхождения > ДопустимоеРасхождение Тогда
		ТекстСообщения = НСтр("ru='Сумма абсолютного расхождения по управленческому учету превышает допустимое.';
							  |en='Total absolute imbalance of management accounting exceeds the allowable'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,, ПревышениеДопустимогоРасхождения);
	КонецЕсли;
	Если КонтролироватьДопустимоеРасхождениеВзм И СуммаАбсолютногоРасхожденияВзм > ДопустимоеРасхождениеВзм Тогда
		ТекстСообщения = НСтр("ru='Сумма абсолютного расхождения по взаиморасчетам превышает допустимое.';
							  |en='Total absolute imbalance of settlements exceeds the allowable'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,, ПревышениеДопустимогоРасхождения);
	КонецЕсли;
	
	Если ПревышениеДопустимогоРасхождения Тогда
		Если НеКонтролироватьРасхождение Тогда
			Если ЭтоПроведение Тогда
				ТекстСообщения = НСтр("ru='Документ будет проведен без контроля на допустимое расхождение.';
									  |en='Document will be entered without any control of the allowable imbalance'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПолучитьДанныеДляПроверкиЗавершенияСверки()
	
// Процедура проверяет завершение сверки ВГО.
// 
// Параметры:
//  Отказ  - Булево
// 
Процедура ПроверитьЗавершениеСверкиВГО(Отказ) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаНачала"			, ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончания"		, ДатаОкончания);
	СтруктураПараметров.Вставить("Организация1"			, Организация1);
	СтруктураПараметров.Вставить("Контрагент1"			, Контрагент1);
	СтруктураПараметров.Вставить("Организация2"			, Организация2);
	СтруктураПараметров.Вставить("Контрагент2"			, Контрагент2);
	СтруктураПараметров.Вставить("РегистрБухгалтерии"	, РегистрБухгалтерии);
	СтруктураПараметров.Вставить("Сценарий"				, Сценарий);
	
	бит_вго_Сервер.ПроверитьЗавершениеСверкиВГО(СтруктураПараметров, Ссылка, Отказ);
	  	
КонецПроцедуры // ПроверитьЗавершениеСверкиВГО()

// Процедура выполняет первоначальное заполнение созданного/скопированного документа.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура
//  СтруктураТаблиц         - Структура
//  Отказ            		- Булево
//  Заголовок 				- Строка
// 
Процедура ПроверкаДанных(Отказ, Заголовок)
	
	// Проверка завершения сверки
	ПроверитьЗавершениеСверкиВГО(Отказ);
		 	    		
КонецПроцедуры // ПроверкаДанных()

#КонецОбласти

#Область ПроцедурыИФункцииДляОбеспеченияПроведенияДокумента

// Процедура выполняет движения по регистрам.
// 
Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	
	// Регистр бит_вго_СтатусыСверкиВГО
	Движения.бит_вго_СтатусыСверкиВГО.Записывать = Истина;
	Движения.бит_вго_СтатусыСверкиВГО.Очистить();
	
	Движение = Движения.бит_вго_СтатусыСверкиВГО.Добавить();
	Движение.РегистрБухгалтерии 			= РегистрБухгалтерии;
	Движение.Сценарий 						= Сценарий;
	Движение.ДатаНачала 					= ДатаНачала;
	Движение.ДатаОкончания 					= ДатаОкончания;
	Движение.Организация1 					= Организация1;
	Движение.Организация2 					= Организация2;
	Движение.Контрагент1 					= Контрагент1;
	Движение.Контрагент2 					= Контрагент2;	
	// Движение.СуммаАбсолютногоРасхождения 	= СуммаАбсолютногоРасхождения;
	// Движение.ДопустимоеРасхождение 			= ДопустимоеРасхождение;
	Движение.СверкаЗавершена 				= Истина;
	 	
КонецПроцедуры // ДвиженияПоРегистрам()

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события "ПриКопировании".
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	ПервоначальноеЗаполнениеДокумента(ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Процедура - обработчик события "ПередЗаписью".
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 

	ПараметрыСверки = Новый Структура("Организация1, Контрагент2", Организация1, Контрагент2);
	бит_вго_Сервер.ПроверитьВозможностьРедактированияДокументовСверкиВГО(ДатаНачала, ПараметрыСверки, Отказ);
	
	Если Не Отказ Тогда
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СуммаАбсолютногоРасхождения") Тогда
			СуммаАбсолютногоРасхождения 	= ЭтотОбъект.ДополнительныеСвойства.СуммаАбсолютногоРасхождения;
			СуммаАбсолютногоРасхожденияВзм  = ЭтотОбъект.ДополнительныеСвойства.СуммаАбсолютногоРасхожденияВзм;
			ДопустимоеРасхождение 			= ЭтотОбъект.ДополнительныеСвойства.ДопустимоеРасхождение;
			ДопустимоеРасхождениеВзм 		= ЭтотОбъект.ДополнительныеСвойства.ДопустимоеРасхождениеВзм;
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ПолучитьДанныеДляПроверкиЗавершенияСверки(Отказ, Истина);	
		КонецЕсли;
	КонецЕсли;
	 	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ОбработкаПроведения".
// 
Процедура ОбработкаПроведения(Отказ, Режим)
		
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
		
	// Проверка данных
	ПроверкаДанных(Отказ, Заголовок);
	
	// Проведение
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект, ПроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
